In [1]:
import pandas as pd

In [3]:
df=pd.read_csv('../data/raw/credit_data.csv')
df.head()

   clientid       income        age         loan  default
0         1  66155.92510  59.017015  8106.532131        0
1         2  34415.15397  48.117153  6564.745018        0
2         3  57317.17006  63.108049  8020.953296        0
3         4  42709.53420  45.751972  6103.642260        0
4         5  66952.68885  18.584336  8770.099235        1

In [4]:
df.shape

(2000, 5)

In [5]:
df.columns

Index(['clientid', 'income', 'age', 'loan', 'default'], dtype='object')

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   clientid  2000 non-null   int64
 1   income    2000 non-null   float64
 2   age       1997 non-null   float64
 3   loan      2000 non-null   float64
 4   default   2000 non-null   int64
dtypes: float64(3), int64(2)
memory usage: 78.3 KB

In [7]:
df.dtypes

clientid      int64
income      float64
age         float64
loan        float64
default       int64
dtype: object

In [8]:
df.isnull().sum()

clientid    0
income      0
age         3
loan        0
default     0
dtype: int64

In [10]:
# //age has missing values
# //calculate the percentage of missing values in age column

df['age'].isnull().mean()*100

0.15

In [11]:
df.describe()

          clientid        income          age          loan      default
count  2000.000000   2000.000000  1997.000000   2000.000000  2000.000000
mean   1000.500000  45331.600018    40.807559   4444.369695     0.141500
std     577.494589  14326.327119    13.624469   3045.410024     0.348624
min       1.000000  20014.489470   -52.423280      1.377630     0.000000
25%     500.750000  32796.459720    28.990415   1939.708847     0.000000
50%    1000.500000  45789.117310    41.317159   3974.719418     0.000000
75%    1500.250000  57791.281670    52.587040   6432.410625     0.000000
max    2000.000000  69995.685580    63.971796  13766.051240     1.000000

In [ ]:
Todo:
Fix negative ages

Handle missing values statistically (in age column)

Treat loan amount outliers properly